besnik.org
#+TITLE: Cose
#+AUTHOR: Scritte da Qualcuno
#+DATE: L'altro giorno

* Viste Aggiornabili
cose scritte col create view per creare una vista che modifica lo schema esterno della
base dati, dal punto di vista delle query questa vista è a tutti gli effetti una tabella
della base, risulta in qualche modo la domanda, posso usare questa vista per modificare
l'istanza della base dati.

posso fare set, oltre a get, di elementi della tabella?
dal punto di vista formale, una vista è una funzione che estrae roba da una tabella

$vista = F(tabella)$

se posso determinare in maniera univoca qual'è l'aggiornamento della base dati che implica
quell'aggiornamento della vista, allora posso aggiornare la tabella, allora la vista può
essere aggiornabile, perchè invertibile, perchè posso arrivare univocamente alla riga che
mi ha dato quella cosa nella tabella

condizioni, vincoli, che valendo questi vincoli la vista è aggiornabile, non si pretende
di individuare tutti i casi in cui è invertibile, ma si definiscono delle condizioni
sufficienti per dire "ok la vista è /x/, quindi la vista è aggiornabile"

questi sono i limiti posti da dbms per considerare una vista come aggiornabile, quando le
considerano aggiornabili
 - assenza di group by
 - assenza di funzioni aggregate
 - assenza di distinct
 - assenza di join, impliciti o espliciti

quello a cui questi join si riferiscono è della parte esterna della vista, quindi
 - solo una tabella
 - niente distinct
 - niente aggregati
 - niente raggruppamento

** Esempio
supponiamo di avere una base dati con tabelle   
 - imp : codice, nome, sede, ruolo, stipendio
 - sedi : sede, responsabile, città

la città dove vanno a lavorare gli impiegati dipende da dove è localizzata la sede
c'è un vincolo di chiave

definiamo una vista per tutti gli impiegati che lavorano a bologna
#+begin_src sql
  create view impBo(...)
  select I.*
  from impiegato I, join sedi S on (I.sede = S.sede)
  where S.città = 'Bologna'
#+end_src

questa vista non è aggiornabile, nella clausola =from= hai due tabelle, quindi c'è un join
implicito, questa vista non è aggiornabile per sti criteri.

ma formuliamola con una query annidata,
#+begin_src sql
where impiegato.sede in (select le sedi a bologna)
#+end_src
oppure
#+begin_src sql
  create view ImpBo(...)
  select I.*
  from impiegato I where I.sede in (select S.sede from Sedi where S.città = 'Bologna')
#+end_src
in questo caso possiamo vedere che la query annidante rispetta tutti i vincoli di
aggiornaiblità, quindi sta query che da le stesse informazioni ora è aggiornabile

nel caso tu debba usare più tabelle, se la vuoi aggiornabile, devi vedere se puoi farla
con select annidate

** Aggiornare query
#+begin_src sql
  insert into ImpBo(...) values(<dati di impiegato>)
#+end_src

ok, ma questa è una vista virtuale, non esiste come tabella, quindi la tupla specificata
dove mi va a finire? la vista non ha un istanza materializzata, la vista è un getter che
si pensa figo, per avere che quel getter dia quella tupla in più la tupla deve andare a
finire nella tabella =imp=, e abbiamo potuto determinare dove doveva andare la tupla
apputno perchè la vista era definita da una query reversibile.

se io dopo questo inserimento in =imp= facessi =select * from ImpBo=, allora vedrei che
l'impiegato è stato aggiunto.

facciamo un'altra query del tipo
#+begin_src sql
  insert into ImpBo(...) values(<dati di impiegato>)
#+end_src

ma mettiamo che stavolta il codice della sede dato sia un codice di sede che già esiste,
ma non si trova a bologna, aggiungo agli impiegati di bologna un impiegato che lavora
nella sede di milano.
Questa cosa possiamo vedere che non funziona benissimo
l'inserimento non rispetta la query che definisce la vista

il controsenso viene dal fatto che la tupla non rispetta la select di definizione della
vista, quando recupero i contenuti della vista quei dati non ci sono, non rispettano il
comportamento della vista.

quindi nella definizione di una vista aggiornabile si può mettere un check per inserimento
e aggiornamento, =with check option=, devo vedere se quell'aggiornamento è compatibile con
la definizione della vista, così quando cerco di inserire o modificare una vista.

Se il dato inserito nella vista sarà visibile attraverso la definizione (=select=) della
vista allora va bene, se il dato inserito non sarà visibile attraverso la definizione
(=select=) della vista allora errore, qui il tizio di milano non sarà visibile dalla
tabella di "vedi quelli di bologna", quindi errore.

visto che una vista puoi definirla in vista di altre viste, puoi avere due tipi di =with
check option= 
 - =with local check option=, in vista di questa vista
 - =with cascaded check option=, in vista di questa vista e delle altre viste da cui è
   definita.

ci sono qundi dei criteri in base ai quali la vista è aggiornabile.

Passo primo da ricordare, l'eventuale riga che viene aggiunta viene in realtà memorizzata
nella tabella di base sulla quale la vista è definita, non nella vista, che è una vista
virtuale.
Nel caso delle viste aggiornabili è poi importante vedere se l'inserimento è compatibile o
meno con la select di definzione della vista, se voglio che ci sia consistenza, e che
quindi i dati inseriti nella vista siano visibili dalla vista, devo definire la vista con
=with check option=, che obbliga il dbms a controllare che l'aggiornamento funzoini.

se non metto la with check option allora o
 - la vista è read only
 - la vista farà un po' i cazzi suoi

* Ora fa prove compitini   
puoi partecipare al compitino anche se non hai superato algoritmi, ma il compitino vale
solo fino a gennaio febbraio, quindi se non passi algoritmi per sta sessione il compitino
bellissimo, non ci fai niente.

se non hai dato algoritmi non puoi partecipare al preappello di dicembre, ad esempio

** Prova compitino VII
*** Schema
 - Policeman : _code_, name, surname, address, areaCode
 - Fine : _code_, policeman, car, date, infraction, streetName, areaCode, cost
 - Infraction : _code_, description
 - Car : _plateNumber_, type, owner
 - Owner : _code_, name, surname, address, areaCode
 - AreaCode : _code_, cityName, provinceName

(nelle query usa CAP e areaCode come sinonimi)
*** Prima query
per ogni cap, il codice ed il numero di multe medie fatte al giorno
(ammissione dal Pala, la definizione \pm torna \pm non torna tantissimo)

da calcolare un numero, e la media di quel numero, mi sono un po' perso, so che va fatta
**** Pala dixit

crea una vista in cui per ogni cap, e per ogni giorno, si contano le multe fatte
#+begin_src sql
  create view multeAreaData(areaCode, date, numero) as
  select areaCode, date, count(code)
  from fine
  group by areaCode, date

  select areaCode, avg(numero)
  from multeAreaData
  group by areaCode
#+end_src

qui visto che code è chiave primaria non cambia fare
 - ~count~
 - ~count *~
 - ~count distinct~

se vuoi calcolare anche le aree per cui non è mai stato fatta una multa fai left join di
qualcosa, poi count viene 0 nella vista, e avg verrà 0 nella select.
Mi sono perso i dettagli, non stavo seguendo molto, pardon.

