besnik.tex
% Created 2022-11-04 Fri 13:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Scritte da Qualcuno}
\date{L'altro giorno}
\title{Cose}
\hypersetup{
 pdfauthor={Scritte da Qualcuno},
 pdftitle={Cose},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Viste Aggiornabili}
\label{sec:org43cf4d2}
cose scritte col create view per creare una vista che modifica lo schema esterno della
base dati, dal punto di vista delle query questa vista è a tutti gli effetti una tabella
della base, risulta in qualche modo la domanda, posso usare questa vista per modificare
l'istanza della base dati.

posso fare set, oltre a get, di elementi della tabella?
dal punto di vista formale, una vista è una funzione che estrae roba da una tabella

\(vista = F(tabella)\)

se posso determinare in maniera univoca qual'è l'aggiornamento della base dati che implica
quell'aggiornamento della vista, allora posso aggiornare la tabella, allora la vista può
essere aggiornabile, perchè invertibile, perchè posso arrivare univocamente alla riga che
mi ha dato quella cosa nella tabella

condizioni, vincoli, che valendo questi vincoli la vista è aggiornabile, non si pretende
di individuare tutti i casi in cui è invertibile, ma si definiscono delle condizioni
sufficienti per dire "ok la vista è \emph{x}, quindi la vista è aggiornabile"

questi sono i limiti posti da dbms per considerare una vista come aggiornabile, quando le
considerano aggiornabili
\begin{itemize}
\item assenza di group by
\item assenza di funzioni aggregate
\item assenza di distinct
\item assenza di join, impliciti o espliciti
\end{itemize}

quello a cui questi join si riferiscono è della parte esterna della vista, quindi
\begin{itemize}
\item solo una tabella
\item niente distinct
\item niente aggregati
\item niente raggruppamento
\end{itemize}

\subsection{Esempio}
\label{sec:org1e7e039}
supponiamo di avere una base dati con tabelle   
\begin{itemize}
\item imp : codice, nome, sede, ruolo, stipendio
\item sedi : sede, responsabile, città
\end{itemize}

la città dove vanno a lavorare gli impiegati dipende da dove è localizzata la sede
c'è un vincolo di chiave

definiamo una vista per tutti gli impiegati che lavorano a bologna
\begin{verbatim}
create view impBo(...)
select I.*
from impiegato I, join sedi S on (I.sede = S.sede)
where S.città = 'Bologna'
\end{verbatim}

questa vista non è aggiornabile, nella clausola \texttt{from} hai due tabelle, quindi c'è un join
implicito, questa vista non è aggiornabile per sti criteri.

ma formuliamola con una query annidata,
\begin{verbatim}
where impiegato.sede in (select le sedi a bologna)
\end{verbatim}
oppure
\begin{verbatim}
create view ImpBo(...)
select I.*
from impiegato I where I.sede in (select S.sede from Sedi where S.città = 'Bologna')
\end{verbatim}
in questo caso possiamo vedere che la query annidante rispetta tutti i vincoli di
aggiornaiblità, quindi sta query che da le stesse informazioni ora è aggiornabile

nel caso tu debba usare più tabelle, se la vuoi aggiornabile, devi vedere se puoi farla
con select annidate

\subsection{Aggiornare query}
\label{sec:org6b947d0}
\begin{verbatim}
insert into ImpBo(...) values(<dati di impiegato>)
\end{verbatim}

ok, ma questa è una vista virtuale, non esiste come tabella, quindi la tupla specificata
dove mi va a finire? la vista non ha un istanza materializzata, la vista è un getter che
si pensa figo, per avere che quel getter dia quella tupla in più la tupla deve andare a
finire nella tabella \texttt{imp}, e abbiamo potuto determinare dove doveva andare la tupla
apputno perchè la vista era definita da una query reversibile.

se io dopo questo inserimento in \texttt{imp} facessi \texttt{select * from ImpBo}, allora vedrei che
l'impiegato è stato aggiunto.

facciamo un'altra query del tipo
\begin{verbatim}
insert into ImpBo(...) values(<dati di impiegato>)
\end{verbatim}

ma mettiamo che stavolta il codice della sede dato sia un codice di sede che già esiste,
ma non si trova a bologna, aggiungo agli impiegati di bologna un impiegato che lavora
nella sede di milano.
Questa cosa possiamo vedere che non funziona benissimo
l'inserimento non rispetta la query che definisce la vista

il controsenso viene dal fatto che la tupla non rispetta la select di definizione della
vista, quando recupero i contenuti della vista quei dati non ci sono, non rispettano il
comportamento della vista.

quindi nella definizione di una vista aggiornabile si può mettere un check per inserimento
e aggiornamento, \texttt{with check option}, devo vedere se quell'aggiornamento è compatibile con
la definizione della vista, così quando cerco di inserire o modificare una vista.

Se il dato inserito nella vista sarà visibile attraverso la definizione (\texttt{select}) della
vista allora va bene, se il dato inserito non sarà visibile attraverso la definizione
(\texttt{select}) della vista allora errore, qui il tizio di milano non sarà visibile dalla
tabella di "vedi quelli di bologna", quindi errore.

visto che una vista puoi definirla in vista di altre viste, puoi avere due tipi di \texttt{with
check option} 
\begin{itemize}
\item \texttt{with local check option}, in vista di questa vista
\item \texttt{with cascaded check option}, in vista di questa vista e delle altre viste da cui è
definita.
\end{itemize}

ci sono qundi dei criteri in base ai quali la vista è aggiornabile.

Passo primo da ricordare, l'eventuale riga che viene aggiunta viene in realtà memorizzata
nella tabella di base sulla quale la vista è definita, non nella vista, che è una vista
virtuale.
Nel caso delle viste aggiornabili è poi importante vedere se l'inserimento è compatibile o
meno con la select di definzione della vista, se voglio che ci sia consistenza, e che
quindi i dati inseriti nella vista siano visibili dalla vista, devo definire la vista con
\texttt{with check option}, che obbliga il dbms a controllare che l'aggiornamento funzoini.

se non metto la with check option allora o
\begin{itemize}
\item la vista è read only
\item la vista farà un po' i cazzi suoi
\end{itemize}

\section{Ora fa prove compitini}
\label{sec:org0226520}
puoi partecipare al compitino anche se non hai superato algoritmi, ma il compitino vale
solo fino a gennaio febbraio, quindi se non passi algoritmi per sta sessione il compitino
bellissimo, non ci fai niente.

se non hai dato algoritmi non puoi partecipare al preappello di dicembre, ad esempio

\subsection{Prova compitino VII}
\label{sec:org15df7e6}
\subsubsection{Schema}
\label{sec:org3cdd896}
\begin{itemize}
\item Policeman : \uline{code}, name, surname, address, areaCode
\item Fine : \uline{code}, policeman, car, date, infraction, streetName, areaCode, cost
\item Infraction : \uline{code}, description
\item Car : \uline{plateNumber}, type, owner
\item Owner : \uline{code}, name, surname, address, areaCode
\item AreaCode : \uline{code}, cityName, provinceName
\end{itemize}

(nelle query usa CAP e areaCode come sinonimi)
\subsubsection{Prima query}
\label{sec:orgcb41b94}
per ogni cap, il codice ed il numero di multe medie fatte al giorno
(ammissione dal Pala, la definizione \textpm{} torna \textpm{} non torna tantissimo)

da calcolare un numero, e la media di quel numero, mi sono un po' perso, so che va fatta
\begin{enumerate}
\item Pala dixit
\label{sec:orgedacd9e}

crea una vista in cui per ogni cap, e per ogni giorno, si contano le multe fatte
\begin{verbatim}
create view multeAreaData(areaCode, date, numero) as
select areaCode, date, count(code)
from fine
group by areaCode, date

select areaCode, avg(numero)
from multeAreaData
group by areaCode
\end{verbatim}

qui visto che code è chiave primaria non cambia fare
\begin{itemize}
\item \texttt{count}
\item \texttt{count *}
\item \texttt{count distinct}
\end{itemize}

se vuoi calcolare anche le aree per cui non è mai stato fatta una multa fai left join di
qualcosa, poi count viene 0 nella vista, e avg verrà 0 nella select.
Mi sono perso i dettagli, non stavo seguendo molto, pardon.
\end{enumerate}
