besnik.org
*** Seconda query
Il cap dove sono state fatte il maggior numero di multe, insieme a quel numero di multe

qui farei una query per legare cap e multe
#+begin_src sql
  create view capMulte(cap, multe) as
  select areaCode, count(code)
  from fine
  where areaCode is not null -- se vuoi evitare problemi quando non specificano areaCode 
  group by areaCode

  select cap from capMulte where multe = (select max multe from capMulte)
#+end_src
**** Pala dixit
una possibile soluzoine è calcolare il numero di multe fatte per cap, e poi vedere il cap
per cui è massimale
#+begin_src sql
  create view multeArea(areaCode, numero) as
  select areaCode, count(code)
  -- count(code) permetterà di dare 0 per gli areaCode che non hanno mai avuto multe
  from fine
  group by areaCode

  select areCode, numero
  from multeArea
  where numero = (select max(numero) from multeArea)
#+end_src

altrimenti

#+begin_src sql
  having count(multe) >= all(select count(multe)
#+end_src

#+begin_src sql
  ...
  (select max(pippo) -- rinominato in un momento di euforia (a detta del Pala in persona)
  from (select count(code) as pippo
  from fine
  group by areaCode))
#+end_src

*** Terza query
per ogni tipo di infrazione, il codice ed il numero medio di multe fatte in un giorno,
=fine.infraction= indica il tipo di multa.

(come prima, il numero medio di multe fatte in un giorno, assumendo che sia stata fatta
una multa per ogni tipo di infrazione)

come al solito si divide in vista che definisce il coso di cui fare la media
#+begin_src sql
  create view contatore(inf, dat, numero) as
  select infraction, date count(fine.code)
  from infraction
  group by code, date
#+end_src
e fare la media dalla vista poi si fa la media
#+begin_src sql
  select inf, avg(numero)
  from contatore
  group by inf
#+end_src
**** Pala dixit

vanno contatae usando una vista, il numero per ogni giorno e per ogni infrazione, poi si
fa la media al variare di cosa
si raggruppa per infraction, al variare di date, quindi nella seconda query togli il group
by date

#+begin_src sql
  create view multeTipoData(infraction, data, numero) as
  select infraction, date, count(code)
  from fine
  group by infraction, date

  select infraction, avg(numero)
  from multeTipData
  group by infraction
#+end_src

*** Quarta query
codice e descrizione del tipo di infrazione per cui sono state emesse il maggior numero di
multe, inseme a tale numero

creiamo una vista del codice massimo e numero
#+begin_src sql
  create view infMaxNum(inf, num) as
  select infraction, count(code)
  from fine
  where count(code) >= all(select count(code) from fine group by infraction)
  group by infraction
#+end_src

poi abbiamo il codice e bisogna fare il join con la tabella infraction per avere anche la
descrizione, quindi la select vera e propia.
#+begin_src sql
  select inf,descrizione,num
  from infMaxNum, infraction
  where infMaxNum.inf = infraction.code
#+end_src

**** Pala dixit
#+begin_src sql
  -- non so perchè ma gli andava di usare la tabella definita prima
  -- la cosa non è necessaria, te fai come vuoi

  -- questa basta definirla come "per ogni infrazione il numero di multe fatte"
  create view multeTipo(infraction, numero) as
  select infraction, sum(numero)
  from multeTipoData
  group by infraction


  select infraction, numero
  from multeTipo
  where numero = (select max(numero) from multeTipo)
  -- oppure
  where numero >= all(select numero from multeTipo)
  -- molti gradi di libertà
#+end_src


#+begin_src sql
  create view multeTipo (infraction, description, numero) as
  select i.code, i.description, count(f.code)
  from  infraction left join fine f on i.code = f.infraction
  group by i.code, i.description
#+end_src
ai fini di questa select il join normale andava bene
se dovevo contare quando certi tipi di multe non hanno multe fatte, allora avrei fatto un
join esterno per considerare anche quei tipi

di solito posso usare indifferentemente i cosi della condizione, quelle righe avranno i
campi di infraction a valori non nulli mentre i corrispondenti campi di fine saranno
nulli, quindi qeulla condizione non sarà verificata per le righe obbligate e non ho capito
che diceva

poi la query principale sarà
#+begin_src sql
  select infraction, description, numero
  from multeTipo
  where numero = (select max(numero) from multeTipo)
#+end_src

*** Quinta query
codice, nome, e cognome di ogni vigile, e costo totale delle multe fatte, ordinando i
valori descrescenti del costo

io avrei fatto questa
#+begin_src sql
  select p.code, p.name, p.surname, sum(f.cost) costo
  from policeman p, fine f
  where f.policeman = p.code
  group by p.code, p.name, p.surname
  order by sum(f.cost) desc
#+end_src

**** Pala dixit
serve la tabella policeman per i dati, e fine per il costo

#+begin_src sql
  select p.code, p.name, p.surname, sum(f.cost) totale
  from policeman p, fine f
  group by p.code, p.name, p.surname
  group by p.code, p.name, p.surname
  order by totale desc -- desc necessario perchè di default il criterio è asc, ascendente
#+end_src

errata da parte di Sergio Cibecchini del join esterno
#+begin_src sql
  ... -- stesso di sopra
  from policeman p left join fine f on f.policeman = p.code
  ... --stesso di spora

#+end_src

** Prova compitino IX
era un compito a due file, quindi le query sono identiche a due a due
*** Schema
(la descrizione oltre alle tabelle, di che significa ogni tabella, è un saggio, vatti a
vedere te le slide, tanto questo è il pdf delle prove compiti che ha messo su moodle)
 - *Paziente* : _cf_, nome, cognome, indirizzo, città, telefono
 - *Medico* : _cf_, nome, cognome, indirizzo, città, telefono
 - *PrenotazoineVisita* : _data_, _ora_,  paziente, medico
 - *Visita* : _codice_, data, paziente, medico, costo
 - *DettaglioVisita* : _visita_, _controllo_,  inNorma, descrizione
 - *Prescrizione* : _visita_, _farmaco_,  posologia
 - *Controllo* : _codice_, nome
 - *Farmaco* : _codice_, nome

*** Prima query
il numero delle visite al termine delle quali non è stato prescritto il farmaco F018

facciamo una vista di tutte le visite in cui...

#+begin_src sql
  create view visiteInCuiNon(visita)
  select visita.codice
  except
  (select prescrizione.visita
  where farmaco = F018)

  select count(visita)
  from visitaInCuiNon
#+end_src

se vuoi fare lo scemo fai

#+begin_src sql
  select (select count (*) from visita) -
  (select count(*) from prescrizione where farmaco = F018)
  as questaCosaFunziona -- ci ho provato nel database impiegati e a postgres va bene
#+end_src

poi la solita epopea del tipo di count non l'ho considerata, ma visto che _visita_,
_codice_ è una superchiave non serve il =count distinct=, per ogni visita ogni codice
compare al più una volta.

Questa minchiata è stata approvata dal Pala.

**** Pala dixit
qui non è decisivo che sia prescritta qualcosa che non sia F018, visto che posso
prescrivere qualcosa ~<> F018~ insieme a qualcosa che è ~= F018~
#+begin_src sql
  select count(codice)
  from visita
  where codice not in(
  select visita
  from prescrizione
  where farmaco = 'F018')
#+end_src
   
*** Seconda query
Il numero di visite in cui non è stato fatto il controllo C014

è identica alla query di sopra

**** Pala dixit
stessa cosa

