besnik.tex

\subsubsection{Seconda query}
\label{sec:org64a0180}
Il cap dove sono state fatte il maggior numero di multe, insieme a quel numero di multe

qui farei una query per legare cap e multe
\begin{verbatim}
create view capMulte(cap, multe) as
select areaCode, count(code)
from fine
where areaCode is not null -- se vuoi evitare problemi quando non specificano areaCode 
group by areaCode

select cap from capMulte where multe = (select max multe from capMulte)
\end{verbatim}
\begin{enumerate}
\item Pala dixit
\label{sec:org87369cf}
una possibile soluzoine è calcolare il numero di multe fatte per cap, e poi vedere il cap
per cui è massimale
\begin{verbatim}
create view multeArea(areaCode, numero) as
select areaCode, count(code)
-- count(code) permetterà di dare 0 per gli areaCode che non hanno mai avuto multe
from fine
group by areaCode

select areCode, numero
from multeArea
where numero = (select max(numero) from multeArea)
\end{verbatim}

altrimenti

\begin{verbatim}
having count(multe) >= all(select count(multe)
\end{verbatim}

\begin{verbatim}
...
(select max(pippo) -- rinominato in un momento di euforia (a detta del Pala in persona)
from (select count(code) as pippo
from fine
group by areaCode))
\end{verbatim}
\end{enumerate}

\subsubsection{Terza query}
\label{sec:org902778a}
per ogni tipo di infrazione, il codice ed il numero medio di multe fatte in un giorno,
\texttt{fine.infraction} indica il tipo di multa.

(come prima, il numero medio di multe fatte in un giorno, assumendo che sia stata fatta
una multa per ogni tipo di infrazione)

come al solito si divide in vista che definisce il coso di cui fare la media
\begin{verbatim}
create view contatore(inf, dat, numero) as
select infraction, date count(fine.code)
from infraction
group by code, date
\end{verbatim}
e fare la media dalla vista poi si fa la media
\begin{verbatim}
select inf, avg(numero)
from contatore
group by inf
\end{verbatim}
\begin{enumerate}
\item Pala dixit
\label{sec:org5519fc1}

vanno contatae usando una vista, il numero per ogni giorno e per ogni infrazione, poi si
fa la media al variare di cosa
si raggruppa per infraction, al variare di date, quindi nella seconda query togli il group
by date

\begin{verbatim}
create view multeTipoData(infraction, data, numero) as
select infraction, date, count(code)
from fine
group by infraction, date

select infraction, avg(numero)
from multeTipData
group by infraction
\end{verbatim}
\end{enumerate}

\subsubsection{Quarta query}
\label{sec:org0b0ad21}
codice e descrizione del tipo di infrazione per cui sono state emesse il maggior numero di
multe, inseme a tale numero

creiamo una vista del codice massimo e numero
\begin{verbatim}
create view infMaxNum(inf, num) as
select infraction, count(code)
from fine
where count(code) >= all(select count(code) from fine group by infraction)
group by infraction
\end{verbatim}

poi abbiamo il codice e bisogna fare il join con la tabella infraction per avere anche la
descrizione, quindi la select vera e propia.
\begin{verbatim}
select inf,descrizione,num
from infMaxNum, infraction
where infMaxNum.inf = infraction.code
\end{verbatim}

\begin{enumerate}
\item Pala dixit
\label{sec:org4f2ce6f}
\begin{verbatim}
-- non so perchè ma gli andava di usare la tabella definita prima
-- la cosa non è necessaria, te fai come vuoi

-- questa basta definirla come "per ogni infrazione il numero di multe fatte"
create view multeTipo(infraction, numero) as
select infraction, sum(numero)
from multeTipoData
group by infraction


select infraction, numero
from multeTipo
where numero = (select max(numero) from multeTipo)
-- oppure
where numero >= all(select numero from multeTipo)
-- molti gradi di libertà
\end{verbatim}


\begin{verbatim}
create view multeTipo (infraction, description, numero) as
select i.code, i.description, count(f.code)
from  infraction left join fine f on i.code = f.infraction
group by i.code, i.description
\end{verbatim}
ai fini di questa select il join normale andava bene
se dovevo contare quando certi tipi di multe non hanno multe fatte, allora avrei fatto un
join esterno per considerare anche quei tipi

di solito posso usare indifferentemente i cosi della condizione, quelle righe avranno i
campi di infraction a valori non nulli mentre i corrispondenti campi di fine saranno
nulli, quindi qeulla condizione non sarà verificata per le righe obbligate e non ho capito
che diceva

poi la query principale sarà
\begin{verbatim}
select infraction, description, numero
from multeTipo
where numero = (select max(numero) from multeTipo)
\end{verbatim}
\end{enumerate}

\subsubsection{Quinta query}
\label{sec:org75c28f4}
codice, nome, e cognome di ogni vigile, e costo totale delle multe fatte, ordinando i
valori descrescenti del costo

io avrei fatto questa
\begin{verbatim}
select p.code, p.name, p.surname, sum(f.cost) costo
from policeman p, fine f
where f.policeman = p.code
group by p.code, p.name, p.surname
order by sum(f.cost) desc
\end{verbatim}

\begin{enumerate}
\item Pala dixit
\label{sec:org0eccd79}
serve la tabella policeman per i dati, e fine per il costo

\begin{verbatim}
select p.code, p.name, p.surname, sum(f.cost) totale
from policeman p, fine f
group by p.code, p.name, p.surname
group by p.code, p.name, p.surname
order by totale desc -- desc necessario perchè di default il criterio è asc, ascendente
\end{verbatim}

errata da parte di Sergio Cibecchini del join esterno
\begin{verbatim}
... -- stesso di sopra
from policeman p left join fine f on f.policeman = p.code
... --stesso di spora

\end{verbatim}
\end{enumerate}

\subsection{Prova compitino IX}
\label{sec:org065b36d}
era un compito a due file, quindi le query sono identiche a due a due
\subsubsection{Schema}
\label{sec:org084f9a2}
(la descrizione oltre alle tabelle, di che significa ogni tabella, è un saggio, vatti a
vedere te le slide, tanto questo è il pdf delle prove compiti che ha messo su moodle)
\begin{itemize}
\item \textbf{Paziente} : \uline{cf}, nome, cognome, indirizzo, città, telefono
\item \textbf{Medico} : \uline{cf}, nome, cognome, indirizzo, città, telefono
\item \textbf{PrenotazoineVisita} : \uline{data}, \uline{ora},  paziente, medico
\item \textbf{Visita} : \uline{codice}, data, paziente, medico, costo
\item \textbf{DettaglioVisita} : \uline{visita}, \uline{controllo},  inNorma, descrizione
\item \textbf{Prescrizione} : \uline{visita}, \uline{farmaco},  posologia
\item \textbf{Controllo} : \uline{codice}, nome
\item \textbf{Farmaco} : \uline{codice}, nome
\end{itemize}

\subsubsection{Prima query}
\label{sec:org554c2c4}
il numero delle visite al termine delle quali non è stato prescritto il farmaco F018

facciamo una vista di tutte le visite in cui\ldots{}

\begin{verbatim}
create view visiteInCuiNon(visita)
select visita.codice
except
(select prescrizione.visita
where farmaco = F018)

select count(visita)
from visitaInCuiNon
\end{verbatim}

se vuoi fare lo scemo fai

\begin{verbatim}
select (select count (*) from visita) -
(select count(*) from prescrizione where farmaco = F018)
as questaCosaFunziona -- ci ho provato nel database impiegati e a postgres va bene
\end{verbatim}

poi la solita epopea del tipo di count non l'ho considerata, ma visto che \uline{visita},
\uline{codice} è una superchiave non serve il \texttt{count distinct}, per ogni visita ogni codice
compare al più una volta.

Questa minchiata è stata approvata dal Pala.

\begin{enumerate}
\item Pala dixit
\label{sec:org670a259}
qui non è decisivo che sia prescritta qualcosa che non sia F018, visto che posso
prescrivere qualcosa \texttt{<> F018} insieme a qualcosa che è \texttt{= F018}
\begin{verbatim}
select count(codice)
from visita
where codice not in(
select visita
from prescrizione
where farmaco = 'F018')
\end{verbatim}
\end{enumerate}

\subsubsection{Seconda query}
\label{sec:orge80ba2b}
Il numero di visite in cui non è stato fatto il controllo C014

è identica alla query di sopra

\begin{enumerate}
\item Pala dixit
\label{sec:org0bb5c09}
stessa cosa
\end{enumerate}
