besnik.org
*** Terza query
il medico che ha visitato il maggior numero di diversi pazienti

a sto punto questo schema lo facciamo un design pattern quante volte lo rifila.
#+begin_src sql
  create view medicoPazienti(medico, numero) as
  select medico, count(distinct paziente)
  from visita
  group by medico

  select medico
  from medicoPazienti
  where numero = (select max(numero) form medicoPazienti)
#+end_src

**** Pala dixit
si fa una vista in cui si contano per i medici il numero di pazienti (diversi) visitati e
si fa il max di questa vista

#+begin_src sql
  create view numPazienti as
  select medico, count(distinct paziente) num
  from visita
  group by medico

  select medico
  from numPazienti
  where num = (select max(num) form numPazienti)
#+end_src

se vuoi contare tutti i medici, magari anche quelli che non hanno fatto nessuna visita,
allora fai un join esterno.

nell'economia della query in questione non ha molto senso vedere anche i medici che non
hanno mai fatto nessuna visita, quindi il join esterno possiamo evitarlo.

*** Quarta query
il paziente che è stato visitato dal maggior numero diverso di medici

stessa cosa di sopra ma invertito
#+begin_src sql
  create view numPazienti as
  select paziente, count(distinct medico) num -- abbiamo cambiato sta riga
  from visita
  group by paziente -- sta riga

  select paziente -- e sta riga, solo quelle
  from numPazienti
  where num = (select max(num) form numPazienti)
#+end_src

*** Quinta query
numero medio di farmaci prescritti al termine delle visite

va fatto un join esterno per contare le visite in cui non prescrivi niente

come al solito creiamo una vista e poi =select avg(numero)=, siamo al secondo design
patter del Pala.
#+begin_src sql
  create view numFarmaci(visita, numero) as
  select v.codice, count(farmaco)
  from visita v left join prescrizione f on v.codice = f.visita
  group by v.codice

  select avg(numero) as HaiCapitoVaBeneComeAlSolito
  from numFarmaci
#+end_src

Il Pala ha fatto la stessa cosa

*** Sesta query
Uguale alla quinta. Il numero medio di controlli fatti in una visita

** Prova compitino X
 - Wine : _code_, name, color, year
 - Color : _code_, name
 - Grape_variety : _code_, name
 - Wine_grape_variety : _wine_, _grape_variety_
 - Food : _code_, name, recipe, food, category
 - Food_category : _code_, name
 - Wine_food_pairing : _code_, wine, food, rating
 - Rating : _code_, description

io posso avere un rating a una stessa coppia più volte, posso dire più volte che le
lasagne con l'Ambrusco ci stanno da 10.

*** Prima
Codici dei fini e delle pietanze che abbinati hanno avuto il massimo numero di valutazioni
'Perfect'

#+begin_src sql
  create view perfects(wine, food, numero)
  select wine, food, count(rating)
  from wine_food_pairing
  where rating = 'Perfect'
  -- qui ho fatto una piccolissima minchiata
  -- il codice non dice un cazzo su che rating ha l'abbinamento
  -- quello devi vederlo dalla tabella rating

  select wine, food, numero
  from perfects
  where numero = (select max(numero) from perfects)
#+end_src

**** Pala dixit
#+begin_src sql
  create view pairings as
  select wine, food, count(r.code) number -- funziona anche count(*), non count distinct (?)
  from wine_food_pairing wfp, rating r
  where rating = r.code and description = 'Perfect'
  group by wine,food

  select wine,food
  from pairings
  where number = (select max(number) from pairing)
#+end_src



*** Seconda
il numero di vini prodotti usando un solo vitigno (=grape_variety=)

#+begin_src sql
  select wine from wine_grape_variety having count(grape_variety) = 1
#+end_src

si poteva usando con =grape_variety= due volte
**** Pala dixit
hey indovina un po' mi sono scordato il group by

#+begin_src sql
  select wine from wine_grape_variety having count(grape_variety) = 1 group by wine
#+end_src

altrimenti

#+begin_src sql
  create view vitigni_per_vino as 
  select wine, count(*) as numero
  from wine_grape_variety
  group by wine

  select count(wine)
  from vitigni_per_vino
  where numero = 1
#+end_src

per fare la conta devi fare una vista, o un (se sei scemo)
#+begin_src sql
  select count(*)
  from (select wine from wine_grape_variety having count(grape_variety) = 1 group by wine) qualcosa
#+end_src

*** Terza
per ogni vino, il codice, il nome, ed il numero di valutazioni di abbinamenti che
coinvolgono quel vino, mostrando 0 per i vini che non compaiono negli abbinamenti

#+begin_src sql
  select w.code, w.name, count(wfp.rating)
  from wine w left join wine_food_pairing wfp on (wfp.wine = w.codice)
  group by w.code, w.name
#+end_src

**** Pala dixit
viene esplicitato per gli 0

va usato wine perchè chiede codice e nome, e visto che chiede tutti i vini va obbligata
ogni riga della tabella wine con un join esterno

e contiamo =wine_food_pairing.code= per contare gli 0 , non può essere sostituito con
=count(*)= visto che va considerato il count 0 per i vini non cosati

#+begin_src sql
  select w.code, w.name, count(wfp.code)
  from wine w left join wine_food_pairing wfp on wine = w.code
  group by w.code, w.name
#+end_src
