besnik.tex

\subsubsection{Terza query}
\label{sec:org8250404}
il medico che ha visitato il maggior numero di diversi pazienti

a sto punto questo schema lo facciamo un design pattern quante volte lo rifila.
\begin{verbatim}
create view medicoPazienti(medico, numero) as
select medico, count(distinct paziente)
from visita
group by medico

select medico
from medicoPazienti
where numero = (select max(numero) form medicoPazienti)
\end{verbatim}

\begin{enumerate}
\item Pala dixit
\label{sec:org554db4f}
si fa una vista in cui si contano per i medici il numero di pazienti (diversi) visitati e
si fa il max di questa vista

\begin{verbatim}
create view numPazienti as
select medico, count(distinct paziente) num
from visita
group by medico

select medico
from numPazienti
where num = (select max(num) form numPazienti)
\end{verbatim}

se vuoi contare tutti i medici, magari anche quelli che non hanno fatto nessuna visita,
allora fai un join esterno.

nell'economia della query in questione non ha molto senso vedere anche i medici che non
hanno mai fatto nessuna visita, quindi il join esterno possiamo evitarlo.
\end{enumerate}

\subsubsection{Quarta query}
\label{sec:orgaf01ec0}
il paziente che è stato visitato dal maggior numero diverso di medici

stessa cosa di sopra ma invertito
\begin{verbatim}
create view numPazienti as
select paziente, count(distinct medico) num -- abbiamo cambiato sta riga
from visita
group by paziente -- sta riga

select paziente -- e sta riga, solo quelle
from numPazienti
where num = (select max(num) form numPazienti)
\end{verbatim}

\subsubsection{Quinta query}
\label{sec:org088b27d}
numero medio di farmaci prescritti al termine delle visite

va fatto un join esterno per contare le visite in cui non prescrivi niente

come al solito creiamo una vista e poi \texttt{select avg(numero)}, siamo al secondo design
patter del Pala.
\begin{verbatim}
create view numFarmaci(visita, numero) as
select v.codice, count(farmaco)
from visita v left join prescrizione f on v.codice = f.visita
group by v.codice

select avg(numero) as HaiCapitoVaBeneComeAlSolito
from numFarmaci
\end{verbatim}

Il Pala ha fatto la stessa cosa

\subsubsection{Sesta query}
\label{sec:org47a1901}
Uguale alla quinta. Il numero medio di controlli fatti in una visita

\subsection{Prova compitino X}
\label{sec:org768b289}
\begin{itemize}
\item Wine : \uline{code}, name, color, year
\item Color : \uline{code}, name
\item Grape\textsubscript{variety} : \uline{code}, name
\item Wine\textsubscript{grape}\textsubscript{variety} : \uline{wine}, \uline{grape\textsubscript{variety}}
\item Food : \uline{code}, name, recipe, food, category
\item Food\textsubscript{category} : \uline{code}, name
\item Wine\textsubscript{food}\textsubscript{pairing} : \uline{code}, wine, food, rating
\item Rating : \uline{code}, description
\end{itemize}

io posso avere un rating a una stessa coppia più volte, posso dire più volte che le
lasagne con l'Ambrusco ci stanno da 10.

\subsubsection{Prima}
\label{sec:orgf96fe0e}
Codici dei fini e delle pietanze che abbinati hanno avuto il massimo numero di valutazioni
'Perfect'

\begin{verbatim}
create view perfects(wine, food, numero)
select wine, food, count(rating)
from wine_food_pairing
where rating = 'Perfect'
-- qui ho fatto una piccolissima minchiata
-- il codice non dice un cazzo su che rating ha l'abbinamento
-- quello devi vederlo dalla tabella rating

select wine, food, numero
from perfects
where numero = (select max(numero) from perfects)
\end{verbatim}

\begin{enumerate}
\item Pala dixit
\label{sec:orgd3b0148}
\begin{verbatim}
create view pairings as
select wine, food, count(r.code) number -- funziona anche count(*), non count distinct (?)
from wine_food_pairing wfp, rating r
where rating = r.code and description = 'Perfect'
group by wine,food

select wine,food
from pairings
where number = (select max(number) from pairing)
\end{verbatim}
\end{enumerate}



\subsubsection{Seconda}
\label{sec:org76bf91e}
il numero di vini prodotti usando un solo vitigno (\texttt{grape\_variety})

\begin{verbatim}
select wine from wine_grape_variety having count(grape_variety) = 1
\end{verbatim}

si poteva usando con \texttt{grape\_variety} due volte
\begin{enumerate}
\item Pala dixit
\label{sec:org22b7e09}
hey indovina un po' mi sono scordato il group by

\begin{verbatim}
select wine from wine_grape_variety having count(grape_variety) = 1 group by wine
\end{verbatim}

altrimenti

\begin{verbatim}
create view vitigni_per_vino as 
select wine, count(*) as numero
from wine_grape_variety
group by wine

select count(wine)
from vitigni_per_vino
where numero = 1
\end{verbatim}

per fare la conta devi fare una vista, o un (se sei scemo)
\begin{verbatim}
select count(*)
from (select wine from wine_grape_variety having count(grape_variety) = 1 group by wine) qualcosa
\end{verbatim}
\end{enumerate}

\subsubsection{Terza}
\label{sec:orgd7f0c7e}
per ogni vino, il codice, il nome, ed il numero di valutazioni di abbinamenti che
coinvolgono quel vino, mostrando 0 per i vini che non compaiono negli abbinamenti

\begin{verbatim}
select w.code, w.name, count(wfp.rating)
from wine w left join wine_food_pairing wfp on (wfp.wine = w.codice)
group by w.code, w.name
\end{verbatim}

\begin{enumerate}
\item Pala dixit
\label{sec:org07b3461}
viene esplicitato per gli 0

va usato wine perchè chiede codice e nome, e visto che chiede tutti i vini va obbligata
ogni riga della tabella wine con un join esterno

e contiamo \texttt{wine\_food\_pairing.code} per contare gli 0 , non può essere sostituito con
\texttt{count(*)} visto che va considerato il count 0 per i vini non cosati

\begin{verbatim}
select w.code, w.name, count(wfp.code)
from wine w left join wine_food_pairing wfp on wine = w.code
group by w.code, w.name
\end{verbatim}
\end{enumerate}
\end{document}